{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "am",
    "1": "ar",
    "2": "az",
    "3": "en",
    "4": "es",
    "5": "fa",
    "6": "fr",
    "7": "he",
    "8": "hi",
    "9": "hy",
    "10": "ka",
    "11": "kk",
    "12": "ne",
    "13": "other",
    "14": "pt",
    "15": "ro",
    "16": "ru",
    "17": "sr",
    "18": "tr",
    "19": "uk",
    "20": "ur",
    "21": "uz"
  },
  "initializer_range": 0.02,
  "label2id": {
    "am": 0,
    "ar": 1,
    "az": 2,
    "en": 3,
    "es": 4,
    "fa": 5,
    "fr": 6,
    "he": 7,
    "hi": 8,
    "hy": 9,
    "ka": 10,
    "kk": 11,
    "ne": 12,
    "other": 13,
    "pt": 14,
    "ro": 15,
    "ru": 16,
    "sr": 17,
    "tr": 18,
    "uk": 19,
    "ur": 20,
    "uz": 21
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "use_cache": false,
  "vocab_size": 119547
}
